<template>
  <div class="pop-wrapper">
    <div class="pop">
      <header class="pop-hd">
        注册协议
      </header>
      <div class="pop-bd" v-scroll>
        <div class="pop-bd-scroller" v-scroll>
          <div><p>欢迎阅读网信理财和网信普惠注册协议（以下简称“本协议”），北京经讯时代科技有限公司作为网信理财平台的运营方、北京东方联合投资管理有限公司作为网信普惠平台的运营方（两家平台以下合称“平台”，两家公司以下合称“本公司”），依据本协议为您提供服务。</p>
            <p>&nbsp;</p>
            <p>特别提醒：您成为平台用户前，必须阅读、同意并接受本协议中所含的所有条款和条件，包括以下明示载明的及因被提及而纳入的文件、条款和条件。 </p>
            <p>&nbsp;</p>
            <p>您申请注册为平台用户，表明您已经充分阅读、理解并无任何附加条件地接受了本协议中含有的所有条款和条件，包括本协议及其所援引的其他文件的条款内容及其法律含义。 </p>
            <p>&nbsp;</p>
            <p>一、用户资格 </p>
            <p>&nbsp;</p>
            <p>1.1&nbsp;您应当具有完全民事权利能力和民事行为能力，并能够独立承担民事责任。 </p>
            <p>1.2&nbsp;您不属于平台不提供用户服务的以下人群： </p>
            <p>（一）&nbsp;未满18周岁和超过70周岁的自然人； </p>
            <p>（二）&nbsp;没有非保本类金融产品投资经历或不熟悉互联网的投资人。 </p>
            <p>&nbsp;</p>
            <p>二、用户账户管理 </p>
            <p>&nbsp;</p>
            <p>2.1&nbsp;您在平台的注册账户仅限本人使用，不得出借或转让。请妥善保管用户名、密码等账户信息，因其泄露或被盗用所产生的任何损失，都将由您自己承担。 </p>
            <p>2.2&nbsp;凡以您的注册账户登录实施的一切行为均视为您本人的行为，所产生的法律后果由您承担。您如发现存在账户被盗用或其他非法使用的情形，应立即以有效方式通知平台；同时，您理解平台对上述情形采取行动需要合理期限，在此之前，平台对任何非法使用行为所导致的损失不承担任何责任。 </p>
            <p>2.3&nbsp;发生下列情形之一的，平台有权基于独立判断，不经通知而单方先行暂停、中断或终止向您提供相关服务，并不对因此产生的损失承担责任： </p>
            <p>（1）&nbsp;平台认为您提供的个人资料不具有真实性、有效性或完整性，包括但不限于盗用他人证件信息注册、认证信息不匹配等；</p>
            <p>（2）&nbsp;平台认为存在异常交易或交易可能涉嫌洗钱、套现、传销、恐怖活动等违法行为时；</p>
            <p>（3）&nbsp;平台发现您使用非法或不正当的技术手段进行危害交易安全或影响公平交易的行为，包括但不限于篡改交易数据、窃取客户信息、窃取交易数据、通过平台攻击其他用户等；</p>
            <p>（4）&nbsp;平台认为您的账户存在被盗用、冒用或其他风险时；</p>
            <p>（5）&nbsp;平台认为您已经违反本协议中规定的各类规则及精神；</p>
            <p>（6）&nbsp;平台为保障交易安全和公平而需要采取措施的其他情形。</p>
            <p>2.4&nbsp;您在平台完成注册后自任意时间段起连续六个月未再登录使用，平台将会向您收取或从您的账户直接一次/多次扣减睡眠账户管理服务费，服务费的收取时间和收取方式平台将会另行在页面上进行公告，您同意对于前述扣费平台无需另行获得您的授权或通知您。当您连续超过2年未再登录平台时，平台有权删除您的账户及对应资料及信息。</p>
            <p>2.5&nbsp;您同意并授权，当平台因战略调整需要系统升级改造、产品功能模块拆分或合并、运营主体变更及其他任何必要的调整时，可以将您的用户名、密码等注册信息、交易历史记录以及其他任何资料同步更新到调整后的门户网站、APP、客户端或其他关联应用上。您在使用此类应用时，可以用原有账户进行登录并操作。</p>
            <p>&nbsp;</p>
            <p>三、服务和费用 </p>
            <p>&nbsp;</p>
            <p>3.1&nbsp;服务 </p>
            <p>3.1.1&nbsp;网信理财（wangxinlicai.com）作为综合金融资产交易信息服务平台，提供包括网络借贷、公募基金、保险、证券和资产管理等多类产品的交易信息中介服务；网信普惠（firstp2p.cn）专门提供网络借贷信息中介相关服务。</p>
            <p>3.1.2&nbsp;请您自行判断、确认平台上相关项目的风险，平台不对您及投融资各方的交易承担任何责任。</p>
            <p>3.1.3&nbsp;第三方责任 </p>
            <p>在任何情况下，对于您使用平台服务过程中涉及由银行、支付机构等第三方提供服务的责任由该第三方承担，平台不承担责任。平台不承担责任的情形包括但不限于： </p>
            <p>（1）&nbsp;第三方未按照您或平台指令进行操作引起的损失或责任； </p>
            <p>（2）&nbsp;第三方原因导致资金未及时到账及与之相关的损失或责任； </p>
            <p>（3）&nbsp;第三方对交易限额或次数等的限制导致的损失或责任。 </p>
            <p>3.2&nbsp;费用 </p>
            <p>3.2.1&nbsp;平台暂不对使用平台服务的投资人收取费用。</p>
            <p>3.2.2&nbsp;尽管有前款约定，但平台保留在法律规定范围内按照运营战略自行发布通知调整收费标准及收费方式的权利。通知发布后，如您继续使用平台服务，视为您对该等通知内容予以认可并接受。 </p>
            <p>3.3&nbsp;其他 </p>
            <p>3.3.1&nbsp;您使用平台所提供服务过程中的其他支出（包括但不限于网络使用费、通信费、资料快递费等），由您自行承担。 </p>
            <p>3.3.2&nbsp;您因使用平台所提供服务完成的交易而取得的收入，应当由您按照所适用法律规定承担相应的税费。 </p>
            <p>&nbsp;</p>
            <p>四、您的资料 </p>
            <p>&nbsp;</p>
            <p>4.1&nbsp;您的资料包括：您在注册或登录过程中、在任何公共信息区域（包括留言栏或反馈区）或通过任何电邮形式或手机短信向平台或其他用户提供的任何资料。您对您的资料负全责，平台仅作为您在网上分发及公布您的资料的渠道。</p>
            <p>4.2&nbsp;您应根据平台的要求提供真实、有效及完整的资料。资料不得：具有欺诈性、虚假、不准确或具误导性；侵犯任何第三方著作权、专利权、商标权、商业秘密或其他专有权利或发表权或隐私权；违反任何适用的法律或法规；有侮辱或者诽谤他人，侵害他人合法权益的内容；有淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容；包含可能破坏、改变、删除、不利影响、秘密截取、未经授权而接触或征用任何系统、数据或个人资料的任何病毒、特洛依木马、蠕虫、定时炸弹、删除蝇、复活节彩蛋、间谍软件或其他电脑程序；直接或间接链接至您无权链接或列入的任何网址或者内容。</p>
            <p>4.3&nbsp;为使平台能够使用您向平台提交的资料，使平台不违反您可能在该资料中拥有的任何权利之目的，您应同意向平台授予非独占、全球性、永久、不可撤销、免使用费、可分许可（通过多层许可的方式）的权利，以行使您在您的资料中（在任何已知或目前为未知媒体中）享有的与您的资料有关的相关权利。平台将根据隐私条款使用您的资料。 </p>
            <p>4.4&nbsp;您有义务维持并更新您的资料，确保其为真实、有效及完整。若您提供任何错误、虚假、过时或不完整的资料，或者平台依其独立判断怀疑资料为错误、虚假、过时或不完整，平台有权拒绝您使用平台服务的部分或全部功能或采取其他处理措施。在此情况下，平台不承担任何责任，并且您同意负担因此所产生的直接或间接的任何支出或损失。</p>
            <p>4.5&nbsp;如因您未及时更新基本资料，导致平台服务无法提供或提供时发生任何错误，您不得将此作为取消交易的理由，平台亦不承担任何责任，所有后果应由您承担。</p>
            <p>4.6&nbsp;除本协议以外，您应同时遵守平台不时发布及更新的全部规则，包括但不限于公告、产品流程说明、平台项目说明、风险提示等。</p>
            <p>4.7&nbsp;您同意平台应法律法规、行业监管（包括但不限于银监会、保监会、互金协会、网贷协会等）等要求之目的，将您的相关信息在平台或其他渠道进行披露。</p>
            <p>&nbsp;</p>
            <p>五、进入和干扰 </p>
            <p>&nbsp;</p>
            <p>5.1&nbsp;未经平台明示或者书面准许，您不能为了任何目的使用任何机器人、蜘蛛软件、刷屏软件或其他自动方式进入网站。 </p>
            <p>5.2&nbsp;此外，您同意您将不会：</p>
            <p>（1）&nbsp;进行任何对平台内部结构造成或可能造成（按平台自行酌情确定）不合理或不合比例的重大负荷的行为； </p>
            <p>（2）&nbsp;未经平台和适当第三方（如适用）事先明示书面准许，对网站的任何内容（除您的资料以外）制作拷贝、进行复制、修改、制作衍生作品、分发或公开展示； </p>
            <p>（3）&nbsp;干扰或试图干扰网站的正常工作或网站上进行的任何活动； </p>
            <p>（4）&nbsp;越过平台可能用于防止或限制进入网站的机器人排除探头或其他形式。 </p>
            <p>&nbsp;</p>
            <p>六、欺诈 </p>
            <p>&nbsp;</p>
            <p>您在使用平台服务的过程中不得从事欺诈行为。若平台有合理理由怀疑您参与了与平台有关的欺诈活动时，平台可单方酌情决定采取中止或终止您的账户等处理措施，并不对因此给您造成的损失承担任何责任。</p>
            <p>&nbsp;</p>
            <p>七、违约 </p>
            <p>&nbsp;</p>
            <p>在不限制其它救济的前提下，如发生以下情形，平台可能限制您的活动，发出有关您的行为的警告、暂时中止、无限期地中止或终止您的用户资格及拒绝向您提供服务：</p>
            <p>7.1&nbsp;您违反本协议或纳入本协议的文件； </p>
            <p>7.2&nbsp;平台无法核验您向平台提供的资料或信息； </p>
            <p>7.3&nbsp;您的行为可能对平台其他用户、平台合作方或平台造成损失或法律责任。 </p>
            <p>&nbsp;</p>
            <p>八、隐私保护 </p>
            <p>&nbsp;</p>
            <p>8.1&nbsp;平台对于您提供的、平台自行收集的、经认证的信息将按照本协议予以保护、使用或者披露。平台可向平台关联实体转让与平台有关的全部或部分权利和义务。 </p>
            <p>8.2&nbsp;您同意平台可使用关于您的相关资料（包括但不限于平台持有的您提交的相关资料，平台从您目前及以前在平台上的活动所获取的其他资料以及平台通过其他方式自行收集的资料）以解决争议、对纠纷进行调停。您同意平台可通过人工或自动程序对您的资料进行跟踪、收集、分析、评价。 </p>
            <p>8.3&nbsp;平台采用行业标准惯例以保护您的资料。您因履行本协议提供给平台的信息，平台不会恶意出售或免费共享给任何第三方，以下情况除外： </p>
            <p>（1）&nbsp;提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等； </p>
            <p>（2）&nbsp;具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院； </p>
            <p>（3）&nbsp;平台的关联实体； </p>
            <p>（4）&nbsp;经平台使用方或平台使用方授权代表同意的第三方。 </p>
            <p>8.4&nbsp;您授权平台，除法律另有规定之外，将您提供给平台的信息、享受平台服务产生的信息（包括本协议签署之前提供和产生的信息）以及平台根据本条约定查询、收集的信息，用于平台及其因服务必要委托的合作伙伴为您提供服务、推荐产品、开展市场调查与信息数据分析。 </p>
            <p>&nbsp;</p>
            <p>九、不保证 </p>
            <p>&nbsp;</p>
            <p>9.1&nbsp;平台对于向用户提供的服务不提供任何形式的承诺或保证，无论该等保证或承诺是明示、默示或法定的。</p>
            <p>9.2&nbsp;平台上合作单位所提供的服务品质及内容由该合作单位自行负责。 </p>
            <p>9.3&nbsp;平台不就持续地、不受影响地或安全地接触并接受平台服务作出担保，且平台网站的经营可能受平台无法控制的多种外部因素影响。 </p>
            <p>&nbsp;</p>
            <p>十、特别声明 </p>
            <p>&nbsp;</p>
            <p>10.1&nbsp;平台并不介入您与其他用户之间的交易，对此，您充分理解并认可。</p>
            <p>10.2&nbsp;您同意就您自身行为之合法性单独承担责任。您同意，平台和平台的所有关联公司和相关实体对平台用户的行为的合法性及产生的任何结果不承担责任。 </p>
            <p>10.3&nbsp;您同意并接受本服务条款，视同您同意并接受平台以投放广告或发送短信、彩信和邮件等形式的营销行为。 </p>
            <p>10.4&nbsp;您使用平台的服务及因此所进行的交易，应当遵守所有适用的国内及国际法律、法令、条例和法规。 </p>
            <p>&nbsp;</p>
            <p>十一、补偿及责任免除 </p>
            <p>&nbsp;</p>
            <p>11.1&nbsp;就任何第三方提出的，由于您违反本协议或纳入本协议的条款和规则或您违反任何法律或侵犯第三方的权利而产生或引起的任一种类和性质的任何索赔、要求、诉讼、损失和损害（包括直接或间接的），无论是已知或未知的，包括合理的律师费，您同意就此对平台和（如适用）平台的母公司、子公司、关联公司、合作伙伴、高级职员、董事、代理人和雇员进行补偿并使其免受损害。</p>
            <p>11.2&nbsp;您同意，基于互联网的特殊性，系统可能会因相关状况无法正常运作，从而使您无法使用任何平台服务或受到不利影响，平台就此对您或第三方不负任何责任，前述状况包括但不限于：</p>
            <p>（1）&nbsp;平台系统停机维护期间；</p>
            <p>（2）&nbsp;电信设备出现故障不能进行数据传输的；</p>
            <p>（3）&nbsp;由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的本平台服务中断或延迟；</p>
            <p>（4）&nbsp;因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成平台系统障碍不能执行业务的。</p>
            <p>&nbsp;</p>
            <p>十二、知识产权的保护 </p>
            <p>&nbsp;</p>
            <p>12.1&nbsp;平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计，均由平台或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>
            <p>12.2&nbsp;非经平台或其他权利人书面同意，任何人不得擅自下载、使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容；不得对平台或对平台的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过Robots、Spiders、自动仪器或手工操作）；不得对平台内容进行转售或商业利用；不得收集和利用产品目录、说明和价格；不得用frame或运用frame技巧把平台或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有；不得以Meta Tags或任何其他"隐藏文本"方式使用平台或其关联公司的名字和商标。 </p>
            <p>&nbsp;</p>
            <p>十三、无代理关系 </p>
            <p>&nbsp;</p>
            <p>用户和平台是独立的合同方，本协议无意建立也没有创立任何代理、合伙、合营、雇员与雇主或特许经营关系。平台也不对任何用户及其网上交易行为做出明示或默许的推荐、承诺或担保。上述性质不因任何事由而改变。</p>
            <p>&nbsp;</p>
            <p>十四、通知 </p>
            <p>&nbsp;</p>
            <p>平台对于您的通知及任何其他的协议、告示或其他关于您使用平台账户及服务的通知，您同意平台可通过平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人（如以邮寄方式向您发出通知的，则在该等通知按照您在平台留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于平台的原因（包括但不限于电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致您未在前述通知视为送达之日收到该等通知的，平台不承担任何责任。</p>
            <p>&nbsp;</p>
            <p>十五、协议的生效、修改、补充和终止 </p>
            <p>&nbsp;</p>
            <p>15.1&nbsp;在本协议履行过程中，平台可根据情况对本协议进行修改。一旦本协议的内容发生变动，将通过平台公告的方式通知您，该等变动自公告发布之日起生效。</p>
            <p>15.2&nbsp;若您对于该等修改和补充不予接受的，您应当立即停止使用平台的服务，而平台亦有权终止您的用户资格。如果您继续使用平台服务，则视为您接受平台对本协议所做的修改，并应遵照修改后的协议执行。 </p>
            <p>15.3&nbsp;本协议在您提交的注册为平台用户的申请获得审核通过时生效。 </p>
            <p>15.4&nbsp;本协议自您注销您的用户账户的申请被平台审核通过之日，或者平台依据本协议及本协议所纳入或被提及的文件、条款和条件终止您的用户资格之日终止。 </p>
            <p>&nbsp;</p>
            <p>十六、条款的解释、法律适用及争端解决 </p>
            <p>&nbsp;</p>
            <p>16.1&nbsp;本协议及其修订的有效性、履行与本协议及其修订效力有关的所有方面均受中华人民共和国法律管辖。 </p>
            <p>16.2&nbsp;因本协议所引起的您与平台的任何纠纷或争议，首先应友好协商解决，如协商不能解决，均应提交北京市朝阳区人民法院诉讼解决。</p>
            <p>16.3&nbsp;本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，在此情况下，本协议的其他条款仍然完全有效并具有约束力。 </p>
            <p>16.4&nbsp;平台未就您或其他方的违约采取行动并不等于平台放弃就随后或类似的违约采取行动的权利。 </p>
            <p>&nbsp;</p>
            <p>&nbsp;</p>
                </div>
        </div>
      </div>
      <div class="pop-ft">
        <button class="yes" v-tap="{methods: disappear}">
          我知道了
        </button>
      </div>
    </div>
  </div>
</template>
<script>
  export default {
    props: {
      show: {
        type: Boolean,
        default: false
      }
    },
    methods: {
      disappear () {
        this.$emit('disappear')
      }
    },
    computed: {
      state () {
        return this.show
      }
    }
  }
</script>
<style lang="stylus" scoped>
  .pop-wrapper {
    position: fixed
    display: flex
    justify-content: center
    left: 0
    top: 0
    right: 0
    bottom: 0
    background-color: rgba(0, 0, 0, .5)
    .pop {
      align-self: center
      width: (1182rem/20)
      height: (1260rem/20)
      border-radius: (16rem/20)
      background-color: #fff
      .pop-hd {
        height: (105rem/20)
        line-height: (105rem/20)
        font-size: (44rem/20)
        color: #000000
        text-align: center
        border-bottom: (3rem/20) solid #e6e6e6
        
      }
      .pop-bd {
        padding: (21rem/20) (47rem/20)
        width: (1087rem/20)
        height: (896rem/20)
        overflow: hidden
        background-color: #fff
        .pop-bd-scroller {
          line-height: (62rem/20)
          color: #666666
        }
      }
      .pop-ft {
        margin-top: (46rem/20)
        text-align: center
        .yes {
          width: (481rem/20)
          line-height: (120rem/20)
          font-weight: 700
          font-size: (54rem/20)
          color: #fff
          background-color: #fe4438
        }
      }
    }
  }
</style>