<template>
  <div class="project">
    <p class="notice">简介:</p>
    <p class="red">该产品借款期限6个月，超过120天可提前还款，提前还款无违约金及其他补偿。</p>
    <p class="weigh">产品介绍</p>
    <p class="text">北京联合开元融资担保有限公司（下称“公司”）是联合创业担保集团有限公司在北京投资设立的控股子公司，是集团为进一步巩固在环渤海地区竞争优势、拓展北京及周边市场的重要基地。公司注册资金人民币3亿元，为北京市信用担保业协会常务理事单位。主营中小企业融资担保，履约担保及投资管理，投资咨询等。公司成立以来，集团先后派驻了多名高管及担保业务骨干，并从北京当地人才选聘了一批具有金融、经济、会计、法律专业背景和从业经验的专业人才。公司根据集团的业务规划，在集团指导下建立了完整的市场开发、业务操作、风险控制、资产管理等运作体系，储备了一批优质客户资源。公司将通过与政府、银行及其他相关机构建立密切合作关系，为北京及周边地区的中小企业提供优质的金融服务。
公司目前与国家开发银行、农业发展银行、农业银行、建设银行、交通银行、招商银行、广发银行、浦发银行、天津银行、北京银行等十余家银行建立授信合作关系，截止2013年10月31日，取得授信总额10亿元。
中国的中小企业超过4000万家，占中国企业总数的89%。大多数中小企业都存在不同程度的融资问题，集团针对中小企业的融资难题，提供多样化的融资服务，具有卓越的创新能力和巨大的发展潜力。
从成立至今，集团公司累计担保额超过121亿元，为10,000多户企业及个人客户提供了融资服务，位于全国担保行业前列。累计支持企业从业人数10余万人，协助企业累计实现销售收入约400亿元，实现利润近50亿元，为地方经济发展做出了卓越的贡献。
    </p>
  </div>
</template>
<script>
  export default {
    props: {
      deal: {
        type: Object,
        default: () => {
          return {}
        }
      }
    }
  }
</script>
<style lang="stylus" scoped>
  .project {
    padding: (45rem/20)
    font-size: (38rem/20)
    line-height: (52rem/20)
    color: #41474d
    .notice {
      color: #909ba8
      margin-right: (133rem/20)
    }
    .red {
      color: #ff0000
    }
    .weigh {
      color: #41474d
      font-weight: 700
    }
  }
</style>